{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-TASK",
    "4": "I-TASK",
    "5": "B-PROJECT",
    "6": "I-PROJECT",
    "7": "B-DEADLINE",
    "8": "I-DEADLINE",
    "9": "B-PRIORITY",
    "10": "I-PRIORITY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DEADLINE": 7,
    "B-PERSON": 1,
    "B-PRIORITY": 9,
    "B-PROJECT": 5,
    "B-TASK": 3,
    "I-DEADLINE": 8,
    "I-PERSON": 2,
    "I-PRIORITY": 10,
    "I-PROJECT": 6,
    "I-TASK": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
